#%% Q21
a = 2
b = 3
print(f'{a} x {b} = {a * b}')

#%% Q22
print(f'{a} + {b} = {b} + {a} = {a + b}')

#%% Q23
c = 5
print(f'{a}*({b} + {c}) = {a}*{b} + {a}*{c}')

#%% Q24
a = 2.4
b = 2.5
print(f'{a} + {b} = {a+b:.4f}')

#%% Q25
a = 5
b = 2
print(f'{a:.2f} - {b:.2f} = {a-b:.4f}')

#%% Q26
birthday = 25
print(f'ฉันเกิดวันที่ {birthday} ธันวาคม')

#%% Q27
a = 5
b = 100
print(f'{a} เท่าของ {b} มีค่าเท่ากับ {a*b}')

#%% Q28
a = 3.5
print(f'เขามีเงินเยอะกว่าฉัน {a:.2f} บาท')

#%% Q29
a = 5
print(f'ฉันทำกำไรได้ {a}%')

#%% Q30
a = 2
b = 3.5
print(f'เมื่อวานฉันขาดทุน {a}% วันนี้ฉันได้กำไร {b:.2f}%')